<!DOCTYPE html>
<html>
  <head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="Standerdstyle.css">
  </head>
  <body>
    <h2>四則演算してみよう</h2>
    <p>
      四則演算とは、たし算ひき算かけ算わり算のことです。
      <h3>実践</h3>
      <p>
        aに6を、bに3を代入し、aとbで、四則演算を試してみましょう！
        <pre>
<code>
a=6
b=3
print(a+b)#たし算
print(a-b)#ひき算
print(a*b)#かけ算
print(a/b)#わり算
</code>
</pre>
        <div class="Textcenter">
          <h1>if文の章</h1>
          <p>
            こちらの02章ではif文についてです。<br>
          </p>
          <h2>if文をかけるようになろう！</h2>
          <h3>if文を書いてみる</h3>
          <p>
            if文とは、条件分岐のことです。もう少し詳しくすると、条件から真偽を求め、真の場合、進んでいく道が分岐されることです。<br>
            ゴミの分別で例えると、あるごみを燃えるか燃えないか分別するとします。<br>
            「あるごみは燃えますか。」という質問を作り、真偽を求めます。<br>
            真（True）の場合は、燃えるごみ袋に入れるようにします。<br>
            それ以外の場合は燃えないごみ袋に入れるようにします。<br>
            このようにして、質問（条件）から真偽求め、その結果によって行うことが分岐されていく。これが条件分岐です。意外と日常生活<br>
          </p>
          <h3>if文の条件式とは</h3>
          <p>
            条件式とは、前の例えだと、質問が条件式にあたります。<br>
            if文の条件式は、()内に条件式を書きます。<br>
            この時の返り値-関数によって求められる値の事を指します-は、bool型となります。<br>
          </p>
          <h3>if文の書き方</h3>
          <p>
            概念を理解したところで、書き方です。次のようになります。
          </p>
          <pre>
<code>
if (条件式):
真(True)の場合、動く内容をここに記入します
else:
それ以外の場合、動く内容をここに記入します    
</code>
</pre>
          <p>
            注意点としては、字下げという作業です。行頭に余白の部分があります。これを、字下げといいます。if文では、この作業が適切にされていないと動きません。関数によって、必要なので覚えておくと、躓いたときに助かりまあす。ちなみに、Tabキーで楽に字下げができます。※ズレていると、きれいに字下げがされません。
          </p>
          <h3>実践</h3>
          <p>
            実際に書いてみましょう。
          </p>
          <pre>
<py-script>
x=1
if (x==1):
x+=1
else:
x-=1
print(x)
</py-script>
</pre>
          <p>
            確認も含め、上から順に説明していきます。xに1を代入しています。ここからif文が始まっています。==は、両側が等しいという意味です。これは、比較演算子というものです。そのため、条件式は、（xが1と等しいか）です。<br>
            <a href="Chapter06.hmtl">[こちら]</a>から他の比較演算子を見れます。この行は、真（True）の場合、動く内容です。内容は、xに1を足しています。 最後はxを出力をしています。
          </p>
          <h2>elifとは？</h2>
          <p>
            elifとは、if文で満たされなかった時に動きます。<br/>
            使用例は以下の通りです。<br/>
          </p>
          <pre>
<code>
if i==0:
print("iは0です。")
elif i==1:
print("iは1です。")
else:
print("iは0と1以外です")
</code>
</pre>
          <div class="Textcenter">
            <h3>実践</h3>
            <p>
            </p>
            <p>
              <DIV style="text-align:right;float:right;"><a href="Chapter03.html">次の章</a>(Listの章)</DIV>
              <a href="Chapter01.html">前の章へ</a>(入出力の章)
            </p>
            <p style="text-align:center">
              <a href="Pymain.html">メイン</a>
            </p>