<!DOCTYPE html>
<html>
  <head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="Standerdstyle.css">
  </head>
  <body>
    <h1>入出力の章</h1>
    <p>
      こちらの章は、関数、入出力、データ型について説明します。
    </p>
    <h2>初めてコードを学ぶ人</h2>
    <p>
      <a href="../Chapter00.html">[こちら]</a>
    </p>
    <h1>出力の節</h1>
    <h2>コードを書く前に</h2>
    <p>
      コードを書く際は、必ず半角でお願いします。<br>
      コードは細かいため、少しでも入力形式が違うと実行できないことがあります。
    </p>
    <h2>数値を表示してみよう</h2>
    <p>
      数値を表示するために、print関数を使います。<br>
      関数がわからない人のために関数について少し触れておきます。
    </p>
    <h2>関数とは？</h2>
    <p>
      「関数」を目にして、苦手意識を持ちがちですが、コードでの関数とは、指示や命令のことです。<br>
      犬をしつける時、「おすわり」の掛け声や手振りを決めます。この掛け声や手振りが関数にあたります。<br>
      また、掛け声や手振りが違うと犬が理解できないように、文字が違ったり、形式が1つでも違うと、エラーをはきます。<br>
    </p>
    <h3>実践</h3>
    <p>
      printは、()内を出力してくれるので、()の中に0を入れます。<br>
      下のコードと同じか確認し、実行してみましょう！
    </p>
    <pre>
<code>
print(0)
</code>
</pre>
    <h2>こんにちわを表示してみよう</h2>
    <p>
      次に、文字である「こんにちわ」を表示してみましょう。
    </p>
    <h3>実践</h3>
    <p>
      ()の中に"こんにちわ"を入れます。<br>
      下のコードと同じか確認し、実行してみましょう！
    </p>
    <pre>
<code>
print("こんにちわ")
</code>
</pre>
    <h2>データ型とは？</h2>
    <p>
      文字を記号で囲むのと、数値を記号で囲まない。この違いにはデータ型が関係しています。<br>
      データには型があり、その型によって約束事があります。<br>
      例えば、文字のデータは文字列型で、"（ダブルクォーテーション）または、'（シングルクォーテーション）で囲む必要があります。<br>
      ※"'のように、異なる記号で囲むとエラーになるので、同じ記号で囲んでください。
      数値は、整数型で、囲む必要はありません。<br>
      それら以外のデータ型一覧は、<a href="Chapter05.html">[こちら]</a><br>
    </p>
    <h2>型の注意点</h2>
    <p>
      数値を囲むと、文字列型になるので、演算処理が行われません。<br>
    </p>
    ---
    <h1>入力の節</h1>
    <h2>データを受け取り、表示してみよう</h2>
    <p>
      データを受け取る際は、`input()`という関数を使います。<br>
      受け取るだけなので、変数に代入すると、扱いやすくなります。<br>
      また、読み込まれたデータ型は、文字列型となります。
    </p>
    <h3>実践</h3>
    <p>
      読み込んだデータをxに代入し、表示させます。<br>
      下のコードと同じか確認し、実行してみましょう！
    </p>
    <pre>
<code>
x= input()
print(x)
</code>
</pre>
    <p style="text-align:right">
      <a href="Chapter02.html">次の章へ</a>(ifの章)
    </p>
    <p style="text-align:center">
      <a href="Pymain.html">メイン</a>
    </p>
  </body>
</html>